
166/166 [==============================] - 510s 3s/step - loss: 0.6529 - accuracy: 0.7678 - val_loss: 0.0000e+00 - val_accuracy: 0.0000e+00
Test loss: 8.284736633300781
Test accuracy: 0.2603704333305359
e+00 - val_accuracy: 0.0000e+00
Test loss: 8.284736633300781
Test accuracy: 0.2603704333305359
Training Features Shape: (21165, 4096)
Training Labels Shape: (21165,)
Test Features Shape: (6533, 4096)
Test Labels Shape: (6533,)
Accuracy: 99.90815857951937 %.
['COVID-19_Radiography_Dataset', 'test', 'train', 'val']
(21165, 100, 100, 3) (21165,) (6533, 100, 100, 3) (6533,) 4
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 23, 23, 96)        34944     
_________________________________________________________________
batch_normalization (BatchNo (None, 23, 23, 96)        384       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 11, 11, 96)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 11, 11, 256)       614656    
_________________________________________________________________
batch_normalization_1 (Batch (None, 11, 11, 256)       1024      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 5, 5, 256)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 5, 5, 384)         885120    
_________________________________________________________________
batch_normalization_2 (Batch (None, 5, 5, 384)         1536      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 5, 5, 384)         1327488   
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 5, 384)         1536      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 5, 5, 256)         884992    
_________________________________________________________________
batch_normalization_4 (Batch (None, 5, 5, 256)         1024      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 2, 2, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              4198400   
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 16388     
=================================================================
Total params: 24,748,804
Trainable params: 24,746,052
Non-trainable params: 2,752
_________________________________________________________________